epsilonrt/duino-boards/duino-boards/boards.txt
################################################################################
## This file is created by epsilonrt for use with duino boards
## https://github.com/epsilonrt/duino-boards
##
## This is the file where fuse settings, BOD options and compiler flags are located.
################################################################################

# Menu options
menu.BOD=BOD
menu.LTO=Compiler LTO

################################################################################

xplbee.name=xPLBee
xplbee.upload.tool=avrdude
xplbee.upload.protocol=arduino
xplbee.upload.maximum_size=130048
xplbee.upload.maximum_data_size=16384
xplbee.upload.speed=115200

xplbee.bootloader.tool=avrdude
xplbee.bootloader.unlock_bits=0xff
xplbee.bootloader.lock_bits=0x0f
xplbee.bootloader.low_fuses=0xf7
xplbee.bootloader.high_fuses=0x1e
xplbee.bootloader.file=optiboot-xplbee.hex

xplbee.build.mcu=atmega1284p
xplbee.build.board=xplbee
xplbee.build.core=MightyCore
xplbee.build.f_cpu=16000000L
xplbee.build.variant=standard

# Brown out detection
xplbee.menu.BOD.2v7=2.7v
xplbee.menu.BOD.2v7.bootloader.extended_fuses=0xfd
xplbee.menu.BOD.4v3=4.3v
xplbee.menu.BOD.4v3.bootloader.extended_fuses=0xfc
xplbee.menu.BOD.1v8=1.8v
xplbee.menu.BOD.1v8.bootloader.extended_fuses=0xfe
xplbee.menu.BOD.disabled=Disabled
xplbee.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
xplbee.menu.LTO.Os=Disabled (default)
xplbee.menu.LTO.Os.compiler.c.extra_flags=
xplbee.menu.LTO.Os.compiler.c.elf.extra_flags=
xplbee.menu.LTO.Os.compiler.cpp.extra_flags=
xplbee.menu.LTO.Os.ltoarcmd=avr-ar

xplbee.menu.LTO.Os_flto=Enabled
xplbee.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
xplbee.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
xplbee.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
xplbee.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

##############################################################

touerisdhmi.name=Toueris Wire HMI
touerisdhmi.vid.0=0x2341
touerisdhmi.pid.0=0x0036

touerisdhmi.upload.tool=avrdude
touerisdhmi.upload.protocol=avr109
touerisdhmi.upload.maximum_size=28672
touerisdhmi.upload.maximum_data_size=2560
touerisdhmi.upload.speed=57600
touerisdhmi.upload.disable_flushing=true
touerisdhmi.upload.use_1200bps_touch=true
touerisdhmi.upload.wait_for_upload_port=true

touerisdhmi.bootloader.tool=avrdude
touerisdhmi.bootloader.low_fuses=0xff
touerisdhmi.bootloader.high_fuses=0x98
touerisdhmi.bootloader.extended_fuses=0xcb
touerisdhmi.bootloader.file=caterina-toueris-dhmi.hex
touerisdhmi.bootloader.unlock_bits=0x3F
touerisdhmi.bootloader.lock_bits=0x2F

touerisdhmi.build.mcu=atmega32u4
touerisdhmi.build.f_cpu=16000000L
touerisdhmi.build.vid=0x2341
touerisdhmi.build.pid=0x8036
touerisdhmi.build.usb_product="Arduino Leonardo"
touerisdhmi.build.board=AVR_LEONARDO
touerisdhmi.build.core=arduino
touerisdhmi.build.variant=toueris-dhmi
touerisdhmi.build.extra_flags={build.usb_flags}

# Brown out detection
touerisdhmi.menu.BOD.2v6=2.6v (default)
touerisdhmi.menu.BOD.2v6.bootloader.extended_fuses=0xcb
touerisdhmi.menu.BOD.2v0=2.0v
touerisdhmi.menu.BOD.2v0.bootloader.extended_fuses=0xce
touerisdhmi.menu.BOD.2v2=2.2v
touerisdhmi.menu.BOD.2v2.bootloader.extended_fuses=0xcd
touerisdhmi.menu.BOD.2v4=2.4v
touerisdhmi.menu.BOD.2v4.bootloader.extended_fuses=0xcc
touerisdhmi.menu.BOD.3v4=3.4v
touerisdhmi.menu.BOD.3v4.bootloader.extended_fuses=0xca
touerisdhmi.menu.BOD.3v5=3.5v
touerisdhmi.menu.BOD.3v5.bootloader.extended_fuses=0xc9
touerisdhmi.menu.BOD.4v3=4.3v
touerisdhmi.menu.BOD.4v3.bootloader.extended_fuses=0xc8
touerisdhmi.menu.BOD.disabled=Disabled
touerisdhmi.menu.BOD.disabled.bootloader.extended_fuses=0xcf

# Compiler link time optimization
touerisdhmi.menu.LTO.Os=Disabled (default)
touerisdhmi.menu.LTO.Os.compiler.c.extra_flags=
touerisdhmi.menu.LTO.Os.compiler.c.elf.extra_flags=
touerisdhmi.menu.LTO.Os.compiler.cpp.extra_flags=
touerisdhmi.menu.LTO.Os.ltoarcmd=avr-ar

touerisdhmi.menu.LTO.Os_flto=Enabled
touerisdhmi.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
touerisdhmi.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
touerisdhmi.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
touerisdhmi.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

##############################################################

touerismb.name=Toueris MODBUS Slave
touerismb.vid.0=0x2341
touerismb.pid.0=0x0036

touerismb.upload.tool=avrdude
touerismb.upload.protocol=avr109
touerismb.upload.maximum_size=28672
touerismb.upload.maximum_data_size=2560
touerismb.upload.speed=57600
touerismb.upload.disable_flushing=true
touerismb.upload.use_1200bps_touch=true
touerismb.upload.wait_for_upload_port=true

touerismb.bootloader.tool=avrdude
touerismb.bootloader.low_fuses=0xff
touerismb.bootloader.high_fuses=0x98
touerismb.bootloader.extended_fuses=0xcb
touerismb.bootloader.file=caterina-toueris-modbus.hex
touerismb.bootloader.unlock_bits=0x3F
touerismb.bootloader.lock_bits=0x2F

touerismb.build.mcu=atmega32u4
touerismb.build.f_cpu=16000000L
touerismb.build.vid=0x2341
touerismb.build.pid=0x8036
touerismb.build.usb_product="Arduino Leonardo"
touerismb.build.board=AVR_LEONARDO
touerismb.build.core=arduino
touerismb.build.variant=toueris-modbus
touerismb.build.extra_flags={build.usb_flags}

# Brown out detection
touerismb.menu.BOD.2v6=2.6v (default)
touerismb.menu.BOD.2v6.bootloader.extended_fuses=0xcb
touerismb.menu.BOD.2v0=2.0v
touerismb.menu.BOD.2v0.bootloader.extended_fuses=0xce
touerismb.menu.BOD.2v2=2.2v
touerismb.menu.BOD.2v2.bootloader.extended_fuses=0xcd
touerismb.menu.BOD.2v4=2.4v
touerismb.menu.BOD.2v4.bootloader.extended_fuses=0xcc
touerismb.menu.BOD.3v4=3.4v
touerismb.menu.BOD.3v4.bootloader.extended_fuses=0xca
touerismb.menu.BOD.3v5=3.5v
touerismb.menu.BOD.3v5.bootloader.extended_fuses=0xc9
touerismb.menu.BOD.4v3=4.3v
touerismb.menu.BOD.4v3.bootloader.extended_fuses=0xc8
touerismb.menu.BOD.disabled=Disabled
touerismb.menu.BOD.disabled.bootloader.extended_fuses=0xcf

# Compiler link time optimization
touerismb.menu.LTO.Os=Disabled (default)
touerismb.menu.LTO.Os.compiler.c.extra_flags=
touerismb.menu.LTO.Os.compiler.c.elf.extra_flags=
touerismb.menu.LTO.Os.compiler.cpp.extra_flags=
touerismb.menu.LTO.Os.ltoarcmd=avr-ar

touerismb.menu.LTO.Os_flto=Enabled
touerismb.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
touerismb.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
touerismb.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
touerismb.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar
